memories
college
life
important
memory
first
year
last
bencher
specially
last
bench
really
rocking
bright
minds
last
bench
making
teachers
able
complete
topics
implicative
want
she's
almost
one
year
love
broke
little
difficult
overcome
happened
still
time
trained
know
till
life
going
leave
grown
stronger
incident
going
major
influence
life
second
end
second
year
started
research
work
grew
new
high
enormously
difficult
field
lead
two
research
completed
products
products
applying
records
awards
nominating
projects
writing
proposals
government
lots
lots
memories
made
think
lot
started
thinking
going
stopped
till
end
life
going
grow
enormously
technical
life
One
time
concrete
mix
properly
materials
mixture
proper
compacted
properly
waterish
white
chin
vary
mixtures
lectures
lecture
help
lecture
come
said
compacted
properly
compact
properly
otherwise
widen
concrete
I’ll
learning
ask
rante
tell
tell
compact
properly
get
let
less
amount
white
concretes
strength
parents
help
every
field
working
go
I’ll
take
permission
support
always
strength
biggest
part
life
parents
help
anywhere
weakness
laziness
whenever
feel
bore
use
mobile
enjoy
friends
overcome
concentrate
avoid
laziness
play
cricket
avoid
laziness
tried
activate
Thank
question
Coming
name
Mohammad
Ashraf
Ayub
Present
pursuing
B
Tech
B
Kits
Warangal
B
Tech
fourth
year
final
year
comes
likes
dislikes
thing
like
playing
outdoor
games
mainly
basketball
like
Basketball
playing
represented
college
university
dislikes
people
talk
back
don’t
like
much
everything
said
front
us
behind
us
coming
hobbies
hobbies
mainly
listen
music
fun
friends
play
games
causal
way
Goal
comes
goal
want
job
want
place
want
get
place
way
get
minimum
respect
someone
many
people
control
nothing
reputed
job
well
known
company
That’s
Thank
question
someone
given
feedback
wrong
thing
done
every
person
natural
thing
person
mistake
time
anything
like
perfect
person
don’t
types
mistakes
mistake
presentation
project
first
presentation
life
didn’t
given
presentation
comes
like
didn't
prepare
presentation
well
gave
slide
perfect
way
didn't
know
slide
didn't
know
like
telling
upon
topic
sir
saying
slides
saying
didn't
take
topic
said
Sir
next
topic
going
sir
said
feedback
given
prepare
according
presentation
done
according
mind
say
want
say
way
give
way
feedback
given
side
helpful
next
presentation
good
useful
presentation
last
Thank
Well
outing
long
time
definitely
call
friends
check
whether
free
free
definitely
go
free
would
go
family
back
time
definitely
going
talk
spend
time
family
evening
family
restaurant
better
option
along
friends
friends
studying
engineering
faced
able
complete
subjects
felt
stressed
number
subjects
need
complete
increasing
able
take
everything
positive
way
use
feel
stressed
concentrate
regular
semester
subjects
later
thought
complete
semester
subjects
everything
take
care
subjects
later
calm
focused
need
completed
subjects
think
I'm
good
question
Well
friend
school
quit
education
family
forcing
get
married
much
confused
want
study
confused
related
parents
follow
dreams
get
position
wanted
study
educated
independent
take
responsibility
suggested
made
understand
situation
even
talked
parents
talk
parents
probably
understood
started
talking
studying
graduation
really
well
Well
really
tough
arrange
everything
short
interval
keen
adjust
situation
first
think
look
ticket
available
within
short
interval
arrange
later
think
watch
hotel
try
book
one
place
think
presentation
overnight
short
time
soon
possible
complete
within
deadline
fly
place
think
organize
task
matter
systematic
way
cater
that’s
already
mentioned
since
like
socializing
free
evening
long
time
would
probably
best
opportunity
meet
people
spend
time
plan
would
probably
go
restaurant
evening
dinner
family
close
friends
colleagues
would
socialize
would
spend
time
taking
stuff
college
work
enjoy
moment
would
like
spending
time
people
help
sharing
knowledge
keeping
mind
relaxed
clam
take
things
take
mind
things
help
bring
bring
stress
levels
evening
friends
family
would
plan
biggest
strength
lies
fact
communicate
people
jell
peers
easily
kind
gives
edge
others
people
listen
say
hence
come
good
leader
One
weaknesses
good
manage
trying
good
management
efficiency
time
times
tend
lose
time
management
skills
provide
better
efficiency
work
years
school
leader
learnt
manage
learnt
manage
concepts
time
management
efficiency
help
parents
teachers
school
college
definitely
able
overcome
realized
needed
everything
get
help
friends
colleagues
team
perform
better
Mcom
2011
Sardar
Patel
University
Gujrat
2015
completed
MBA
symbiosis
Pune
part
also
done
language
certification
course
french
language
also
month
HR
program
spectrum
infograph
services
talk
likes
dislikes
like
travelling
reading
book
playing
cricket
goal
life
part
big
reputed
firm
HR
manager
Thank
current
profile
handling
pay
roll
well
I'm
actually
taking
care
joining
formalities
everything
also
taking
care
pay
rolls
sometimes
happens
part
work
assigned
due
shortage
time
colleagues
used
help
minimizing
time
work
proper
quality
helping
colleague
challan
enrollment
taking
care
exit
formalities
problem
found
one
problem
joining
formalities
one
candidate
education
certificate
certificate
without
certificate
monsoon
like
roaming
around
husband
nearby
Delhi
long
drive
definitely
shopping
dinner
outside
talk
interact
long
drive
fond
long
drive
First
plan
tickets
stay
arrange
everything
online
prepare
conference
presentation
make
sure
prepared
presentation
within
days
shortage
time
definitely
try
complete
presentation
within
three
days
Yes
case
remember
working
project
simultaneously
parallel
run
done
client
happened
came
different
way
solving
problem
thought
solving
different
way
happened
result
quite
different
pointed
made
mistake
didn't
complete
work
quality
finally
sorted
correct
well
correct
provided
feedback
provided
new
innovation
new
way
solving
problem
appreciated
got
appreciation
everyone
team
manager
client
working
HR
executive
day
day
basis
receive
different
grievances
arises
company
come
salary
issue
like
salary
detected
explain
leave
assigned
salary
deducted
many
instances
like
employees
satisfied
issue
actually
know
policies
due
come
issues
us
satisfy
providing
reason
deduction
Yes
regarding
remember
instance
working
bachelors
commerce
simultaneously
PA
internship
wherein
happened
living
baroda
higher
studies
didn't
went
home
two
years
examination
desperate
go
home
came
know
paper
leaked
need
give
paper
carried
books
along
went
hometown
really
stressed
would
happen
able
study
properly
somehow
function
home
able
study
properly
stressed
coming
back
ten
days
exam
decided
happen
studied
got
done
talk
strengths
positive
attitude
quick
learner
always
appreciate
person
lot
work
apart
profile
also
help
colleagues
weaknesses
would
like
say
cannot
say
anybody
anybody
comes
asking
help
help
despite
different
work
help
without
complains
everything
even
though
work
gets
affected
prioritize
work
properly
help
work
gets
completed
time
