The
memories
of
my
college
life
is
important
memory
in
the
first
year
is
I
was
last
bencher
and
specially
the
last
bench
was
really
rocking
that
is
that
there
is
all
bright
minds
in
the
last
bench
making
their
teachers
not
able
to
complete
their
topics
and
we
are
so
implicative
that
we
want
more
than
what
she's
having
Then
I
had
almost
one
year
of
love
then
we
broke
up
It
was
little
difficult
to
overcome
what
happened
still
at
that
time
I
trained
myself
and
I
know
till
my
life
I
am
not
going
to
leave
this
and
I
have
grown
stronger
after
this
incident
This
is
going
to
have
major
influence
in
my
life
Then
in
my
second
end
of
second
year
I
started
doing
some
research
work
I
grew
new
high
enormously
in
the
difficult
field
I
lead
two
research
completed
products
I
did
own
products
applying
for
records
for
awards
nominating
projects
writing
proposals
to
the
government
And
I
have
lots
of
lots
of
memories
that
made
me
to
think
lot
I
started
thinking
and
this
is
not
going
to
stopped
till
the
end
of
my
life
I
am
going
to
grow
enormously
more
in
technical
life
One
time
doing
concrete
I
will
not
mix
properly
all
the
materials
So
mixture
is
not
proper
and
i
will
not
compacted
properly
so
there
is
waterish
you
There
is
white
chin
between
vary
mixtures
so
all
lectures
my
lecture
help
me
lecture
come
to
me
and
said
they
you
not
compacted
properly
so
you
have
to
compact
properly
otherwise
there
will
be
more
widen
you
are
concrete
so
I’ll
learning
so
i
ask
you
to
at
to
should
be
more
rante
she
tell
he
tell
that
you
should
compact
properly
then
we
will
get
let
less
amount
of
white
concretes
My
strength
is
my
parents
because
they
help
me
in
every
field
while
I
am
working
or
m
where
I
go
I’ll
take
permission
for
there
They
support
me
always
so
my
strength
is
my
biggest
part
of
my
life
is
my
parents
they
help
me
anywhere
the
weakness
is
laziness
whenever
I
feel
bore
I
use
mobile
and
enjoy
with
friends
so
to
overcome
from
that
I
should
concentrate
and
avoid
my
laziness
I
play
cricket
and
avoid
my
laziness
and
they
tried
to
activate
Thank
you
for
the
question
Coming
to
about
myself
My
name
is
Mohammad
Ashraf
Ayub
and
at
Present
I
am
pursuing
my
B
Tech
from
B
Kits
Warangal
B
Tech
fourth
year
final
year
and
when
it
comes
to
my
likes
and
dislikes
the
most
thing
I
like
is
the
playing
the
outdoor
games
mainly
the
basketball
I
like
Basketball
playing
and
I
represented
my
college
for
the
university
My
dislikes
are
that
the
people
who
talk
back
of
me
I
don’t
like
them
much
and
everything
should
be
said
in
front
of
us
and
not
behind
of
us
and
coming
to
my
hobbies
My
hobbies
mainly
to
listen
to
music
having
fun
with
friends
and
just
play
games
in
causal
way
Goal
when
it
comes
to
my
goal
I
want
job
I
want
place
I
want
myself
to
get
in
place
that
the
way
I
can
get
minimum
respect
of
someone
and
many
people
should
be
under
me
and
I
should
have
some
control
that
is
nothing
but
reputed
job
and
in
well
known
company
That’s
it
Thank
you
Here
my
question
is
the
someone
has
given
me
feedback
what
the
wrong
thing
I
have
done
As
every
person
as
natural
thing
of
person
that
he
will
do
any
mistake
any
time
any
where
is
not
anything
like
perfect
person
that
he
don’t
do
any
types
of
mistakes
Here
my
mistake
was
in
doing
the
presentation
of
our
project
It
was
my
first
presentation
in
my
life
I
didn’t
have
given
any
presentation
and
when
it
comes
I
was
like
I
didn't
prepare
my
presentation
well
I
gave
the
slide
in
the
perfect
way
but
I
didn't
know
what
slide
was
where
I
didn't
know
I
was
like
telling
upon
my
topic
But
the
sir
was
saying
on
the
slides
they
were
saying
you
didn't
take
this
topic
I
said
Sir
it
was
next
topic
I
am
going
sir
they
said
the
feedback
the
given
to
me
prepare
according
to
the
presentation
that
you
have
done
not
according
the
mind
you
say
if
you
want
to
say
in
that
way
give
in
that
way
So
it
was
the
feedback
that
was
given
by
my
side
It
was
very
helpful
as
the
next
presentation
was
very
good
As
I
have
useful
presentation
at
the
last
Thank
you
Well
an
outing
after
long
time
definitely
I
will
call
up
my
few
friends
and
check
out
whether
they
are
free
if
they
are
free
I
will
definitely
go
with
them
or
if
they
are
not
free
then
I
would
go
on
the
family
out
If
I
am
back
on
time
I
am
definitely
going
to
talk
or
spend
time
with
my
family
So
an
evening
with
my
family
at
restaurant
will
be
better
option
for
me
along
with
my
friends
if
friends
are
there
When
I
was
studying
engineering
I
faced
some
of
the
I
was
not
able
to
complete
some
of
the
subjects
and
I
felt
stressed
because
of
that
the
number
of
subjects
I
need
to
do
complete
was
increasing
and
I
was
not
able
to
take
everything
the
positive
way
so
I
use
to
feel
stressed
and
I
did
not
concentrate
on
the
regular
semester
subjects
and
later
on
I
thought
that
if
I
complete
these
semester
subjects
and
everything
as
of
now
then
I
can
take
care
of
those
subjects
later
so
I
did
not
just
calm
down
focused
on
what
I
need
to
do
and
I
have
completed
those
subjects
and
now
now
I
think
I'm
good
question
Well
I
had
friend
in
my
school
and
she
was
about
to
quit
education
because
her
family
was
forcing
her
to
get
married
so
she
was
very
much
confused
she
want
to
study
but
she
was
confused
about
what
to
do
related
to
the
parents
or
to
follow
her
dreams
so
I
get
her
position
I
wanted
her
to
study
and
to
be
educated
so
that
she
can
be
independent
she
can
take
her
own
responsibility
so
I
suggested
her
I
made
her
understand
about
the
situation
I
even
talked
to
their
parents
talk
to
her
parents
and
they
probably
understood
it
and
they
started
talking
and
now
she
is
studying
she
is
doing
graduation
and
she
is
doing
really
well
Well
its
really
tough
to
arrange
everything
in
short
interval
but
as
I
have
keen
to
adjust
to
any
situation
so
first
I
think
I
will
look
for
the
ticket
is
it
available
within
that
short
interval
and
I
will
arrange
that
and
later
I
think
I
will
watch
for
hotel
I
will
try
to
book
one
in
the
same
place
then
I
will
think
about
my
presentation
I
will
do
it
overnight
in
the
short
time
and
as
soon
as
possible
so
that
I
can
complete
it
within
the
deadline
and
fly
to
the
place
so
I
think
I
will
organize
all
the
task
in
this
matter
in
systematic
way
I
just
cater
to
that
so
that’s
all
As
I
already
mentioned
since
I
like
socializing
free
evening
after
long
time
would
probably
be
the
best
opportunity
me
to
meet
people
and
spend
time
with
them
so
my
plan
would
be
to
probably
go
out
to
restaurant
that
evening
for
dinner
with
family
or
with
close
friends
or
colleagues
I
would
socialize
with
them
I
would
spend
my
time
taking
about
stuff
other
than
college
or
work
and
enjoy
the
moment
with
them
I
would
like
that
spending
time
with
people
will
help
in
sharing
knowledge
and
keeping
your
mind
relaxed
and
clam
so
it
will
take
things
off
take
your
mind
off
things
and
help
you
bring
down
bring
down
your
stress
levels
so
an
evening
out
with
friends
and
family
would
be
my
plan
My
biggest
strength
lies
in
the
fact
that
i
can
communicate
with
people
and
jell
with
my
peers
very
easily
and
when
I
can
do
this
I
kind
of
gives
me
edge
over
others
people
can
listen
to
what
I
say
and
hence
I
come
out
good
leader
One
of
the
weaknesses
that
I
have
is
good
manage
trying
to
have
good
management
between
efficiency
and
time
I
at
times
tend
to
lose
out
on
my
time
management
skills
to
provide
better
efficiency
into
the
work
that
I
do
and
over
few
years
in
school
as
leader
I
have
learnt
that
I
have
to
manage
I
have
learnt
I
have
to
manage
both
these
concepts
time
management
and
efficiency
with
help
from
my
parents
and
teachers
in
school
and
college
and
definitely
will
be
able
to
overcome
that
I
realized
that
I
do
not
needed
to
do
everything
on
my
own
and
that
I
can
get
help
from
my
friends
and
colleagues
so
that
as
team
we
can
perform
better
Mcom
in
2011
from
Sardar
Patel
University
which
is
in
Gujrat
itself
and
2015
I
have
completed
my
MBA
from
symbiosis
Pune
and
part
from
this
also
I
have
done
language
certification
course
for
french
language
and
also
month
HR
program
from
spectrum
infograph
services
and
if
we
talk
about
my
likes
and
dislikes
I
like
travelling
reading
book
playing
cricket
and
my
goal
in
life
is
to
be
part
of
big
reputed
firm
as
HR
manager
That
is
all
Thank
you
In
my
current
profile
I
am
handling
pay
roll
as
well
So
I'm
actually
taking
care
of
joining
formalities
and
everything
and
also
taking
care
of
pay
rolls
So
sometimes
it
happens
that
the
part
of
work
which
has
not
be
assigned
but
due
to
shortage
of
time
we
all
colleagues
used
to
help
each
other
and
minimizing
the
time
and
do
work
with
proper
quality
and
I
am
helping
my
colleague
with
challan
and
enrollment
and
taking
care
of
exit
formalities
and
the
problem
was
that
I
found
one
problem
in
joining
formalities
where
one
candidate
had
only
his
education
certificate
and
no
other
certificate
and
without
any
certificate
As
it
is
monsoon
I
like
roaming
around
with
my
husband
nearby
Delhi
and
for
long
drive
and
definitely
we
will
have
some
shopping
and
dinner
outside
and
talk
and
interact
with
each
other
and
having
long
drive
I
am
fond
of
long
drive
First
of
all
I
will
plan
for
my
tickets
and
stay
and
I
will
arrange
everything
online
Then
I
will
prepare
for
the
conference
and
in
the
presentation
I
will
make
sure
that
I
am
prepared
for
the
presentation
within
days
So
there
is
shortage
of
time
definitely
I
will
try
to
complete
the
presentation
within
three
days
and
that
is
all
Yes
there
was
case
where
I
remember
where
I
was
working
on
project
and
simultaneously
parallel
run
was
done
by
the
client
and
what
happened
was
they
came
up
with
different
way
of
solving
the
problem
and
I
had
thought
of
solving
it
in
different
way
but
what
happened
result
was
quite
different
and
he
pointed
out
that
you
made
mistake
and
didn't
complete
the
work
with
quality
so
finally
we
sorted
out
that
what
I
did
was
correct
as
well
as
he
did
was
correct
so
then
he
provided
me
the
feedback
that
you
have
provided
new
innovation
and
new
way
of
solving
the
problem
so
he
appreciated
that
and
got
appreciation
by
everyone
my
team
my
manager
and
my
client
I
am
working
as
HR
executive
and
on
day
to
day
basis
I
receive
different
grievances
that
arises
in
the
company
they
come
with
salary
issue
like
why
my
salary
has
been
detected
so
i
explain
them
that
because
of
the
leave
that
has
not
been
assigned
to
you
because
of
that
your
salary
has
been
deducted
their
have
been
many
instances
like
that
where
the
employees
are
not
satisfied
with
the
issue
actually
they
do
not
know
the
policies
due
to
which
they
come
up
with
issues
to
us
and
we
satisfy
them
providing
them
with
the
reason
for
the
deduction
Yes
regarding
this
I
remember
the
instance
where
I
was
working
my
bachelors
in
commerce
and
simultaneously
I
was
doing
PA
internship
so
wherein
what
happened
I
was
living
in
baroda
for
my
higher
studies
and
I
didn't
went
to
home
for
two
years
and
after
examination
I
was
just
desperate
to
go
home
and
then
we
came
to
know
that
paper
is
leaked
out
and
we
need
to
give
the
paper
again
So
I
carried
all
my
books
along
with
me
and
I
went
to
hometown
and
I
was
really
stressed
as
what
would
happen
if
I
am
not
able
to
study
properly
and
somehow
there
was
function
at
home
and
I
was
not
able
to
study
properly
and
I
was
very
stressed
over
it
and
then
after
coming
back
after
ten
days
again
the
exam
were
decided
to
happen
and
I
studied
and
it
got
done
If
I
talk
about
my
strengths
I
have
very
positive
attitude
I
am
quick
learner
and
I
always
appreciate
if
person
does
lot
of
work
apart
their
profile
I
also
help
my
colleagues
and
weaknesses
I
would
like
to
say
that
I
cannot
say
not
to
anybody
and
if
anybody
comes
to
asking
for
help
I
help
them
despite
I
have
different
work
with
me
So
I
help
without
any
complains
and
everything
even
though
my
work
gets
affected
but
now
I
prioritize
my
work
properly
and
then
help
so
that
my
work
gets
completed
in
time
